Hi @JonasTaulienSolutions,

Records belong to a domain and are deleted when the domain is. So the existing record can not be updated, it must be recreated. Unfortunately, Terraform does not understand that relationship. This is because the `name` of the domain is the only thing creating a dependency between the record and the domain, but the `name` does not change.

There is a long thread here with much more details on the Terraform internals and similar issues with other providers:  https://github.com/hashicorp/terraform/issues/8099 

Luckily, in this case, there is a very straightforward workaround: use `digitalocean_domain.example_com.id` instead of `digitalocean_domain.example_com.name`. This works as domain resource uses its name as its ID. So while the actual values of `name` and `id` are the same, the `id` is "unknown" upon recreation. This forces the record to be recreated.

Example:

```hcl
resource "digitalocean_droplet" "my_droplet" {
  image      = "debian-11-x64"
  name       = "my-droplet"
  region     = "nyc3"
  size       = "s-1vcpu-1gb"
  monitoring = true
}

resource "digitalocean_domain" "example_com" {
  name = "example23453452346.com"
  ip_address = digitalocean_droplet.my_droplet.ipv4_address
}

resource "digitalocean_record" "my_record" {
  domain = digitalocean_domain.example_com.id
  type = "A"
  name = "www"
  value = digitalocean_droplet.my_droplet.ipv4_address
}
```

Plan when the Droplet is recreated:

```
  # digitalocean_domain.example_com must be replaced
-/+ resource "digitalocean_domain" "example_com" {
      ~ id         = "example23453452346.com" -> (known after apply)
      ~ ip_address = "137.184.56.140" -> (known after apply) # forces replacement
        name       = "example23453452346.com"
      ~ ttl        = 1800 -> (known after apply)
      ~ urn        = "do:domain:example23453452346.com" -> (known after apply)
    }

  # digitalocean_droplet.my_droplet must be replaced
-/+ resource "digitalocean_droplet" "my_droplet" {
      ~ created_at           = "2022-01-04T21:31:02Z" -> (known after apply)
      ~ disk                 = 25 -> (known after apply)
      ~ id                   = "280669286" -> (known after apply)
      ~ ipv4_address         = "137.184.56.140" -> (known after apply)
      ~ ipv4_address_private = "10.136.111.25" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 1024 -> (known after apply)
        name                 = "my-droplet"
      ~ price_hourly         = 0.00744 -> (known after apply)
      ~ price_monthly        = 5 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ region               = "nyc1" -> "nyc3" # forces replacement
      ~ status               = "active" -> (known after apply)
      - tags                 = [] -> null
      ~ urn                  = "do:droplet:280669286" -> (known after apply)
      ~ vcpus                = 1 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "b663a981-dc84-11e8-8650-3cfdfea9f8c8" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # digitalocean_record.my_record must be replaced
-/+ resource "digitalocean_record" "my_record" {
      ~ domain   = "example23453452346.com" -> (known after apply) # forces replacement
      - flags    = 0 -> null
      ~ fqdn     = "www.example23453452346.com" -> (known after apply)
      ~ id       = "286629546" -> (known after apply)
        name     = "www"
      - port     = 0 -> null
      - priority = 0 -> null
      ~ ttl      = 1800 -> (known after apply)
      ~ value    = "137.184.56.140" -> (known after apply)
      - weight   = 0 -> null
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```

In particular, note:

    ~ domain   = "example23453452346.com" -> (known after apply) # forces replacement

I'm seeing now that or docs suggest the approach you are using. We'll get those updated to hopefully prevent people from running into this in the future.